In [1]:
import settings
import psycopg2
import datetime
import pandas as pd

In [2]:
settings.DB.host
db = settings.DB
print(db.host)
print(db.user)

127.0.0.1
postgres

In [3]:
def connect(db):
    global conn
    conn = psycopg2.connect(dbname=db.name, user=db.user, 
                        password=db.password, host=db.host)
    conn.autocommit = True
    global cursor
    cursor = conn.cursor()
    return cursor

In [4]:
def fillFaculties(cur):
    cur.execute("INSERT into beta_facultiest values (0, 'ИУ', 11)")
    cur.execute("INSERT into beta_facultiest values (1, 'ФН', 14)")
    cur.execute("INSERT into beta_facultiest values (2, 'СГН', 11)")
    cur.execute("INSERT into beta_facultiest values (3, 'МТ', 11)")
    cur.execute("INSERT into beta_facultiest values (4, 'РЛ', 11)")
def select(name):
    db = settings.DB
    conn = psycopg2.connect(dbname=db.name, user=db.user, 
                        password=db.password, host=db.host)
    return pd.read_sql("select * from " + name, conn)
def mockDB(cur):
    # outgoing:
    cur.execute("INSERT into beta_persont values (1, 'Даниил', 'Иванов', 1, 2,\
    'биография Д.И. lorem ipsum lorem ipsum lorem ipsum',\
    true, 0, 0, 'uname1', 2, 1, false, false)")
    cur.execute("INSERT into beta_persont values (2, 'Михаил', 'Иванов', 1, 2,\
    'биография М.И. lorem ipsum lorem ipsum lorem ipsum',\
    true, 0, 0, 'uname2', 2, 1, false, false)")
    
    #incoming
    cur.execute("INSERT into beta_persont values (3, 'Александр', 'Иванов', 1, 2,\
    'биография 3 lorem ipsum lorem ipsum lorem ipsum',\
    true, 0, 0, 'uname3', 2, 1, false, false)")
    cur.execute("INSERT into beta_persont values (4, 'Алексей', 'Иванов', 1, 2,\
    'биография 4 lorem ipsum lorem ipsum lorem ipsum',\
    true, 0, 0, 'uname4', 2, 1, false, false)")
    
    #friends safe
    cur.execute("INSERT into beta_persont values (5, 'Николай', 'I', 1, 3,\
    'биография 5 lorem ipsum lorem ipsum lorem ipsum',\
    true, 0, 0, 'uname5', 2, 2, false, true)")
    cur.execute("INSERT into beta_persont values (6, 'Николай', 'II', 1, 3,\
    'биография 6 lorem ipsum lorem ipsum lorem ipsum',\
    true, 0, 0, 'uname6', 2, 2, false, true)")
    
    #friends unsafe
    cur.execute("INSERT into beta_persont values (7, 'Лжедмитрий', 'II', 1, 4,\
    'биография 6 lorem ipsum lorem ipsum lorem ipsum',\
    true, 0, 0, 'uname6', 2, 1, false, true)")    
    
    cur.execute("INSERT into beta_persont values (421423205, 'Астахов', 'Сергей', 1, 2,\
    'биография А.С. lorem ipsum lorem ipsum lorem ipsum',\
    true, 0, 0, 'trickster2038', 2, 1, false, false)")
    cur.execute("INSERT into beta_friendst values (0, 421423205, 1, false)")
    cur.execute("INSERT into beta_friendst values (1, 421423205, 2, false)")
    cur.execute("INSERT into beta_friendst values (2, 3, 421423205, false)")
    cur.execute("INSERT into beta_friendst values (3, 4, 421423205, false)")

In [77]:
cursor = connect(db)
cursor.execute("truncate beta_persont")
cursor.execute("truncate beta_friendst")
cursor.execute("truncate beta_facultiest")
# cursor.execute("truncate django_migrations")

# cursor.execute("drop table beta_persont")
# cursor.execute("drop table beta_friendst")
# cursor.execute("drop table beta_facultiest")
# cursor.execute("drop table beta_image")
# cursor.execute("drop table beta_userimage")
mockDB(cursor)
fillFaculties(cursor)

In [78]:
select("beta_persont")

,id,name,surname,department,course,bio,is_filled,rating,accesss,username,faculty,trusted,is_moderator,is_curator
0,1,Даниил,Иванов,1,2,биография Д.И. lorem ipsum lorem ipsum lorem i...,True,0,0,uname1,2,1,False,False
1,2,Михаил,Иванов,1,2,биография М.И. lorem ipsum lorem ipsum lorem i...,True,0,0,uname2,2,1,False,False
2,3,Александр,Иванов,1,2,биография 3 lorem ipsum lorem ipsum lorem ipsum,True,0,0,uname3,2,1,False,False
3,4,Алексей,Иванов,1,2,биография 4 lorem ipsum lorem ipsum lorem ipsum,True,0,0,uname4,2,1,False,False
4,5,Николай,I,1,3,биография 5 lorem ipsum lorem ipsum lorem ipsum,True,0,0,uname5,2,2,False,True
5,6,Николай,II,1,3,биография 6 lorem ipsum lorem ipsum lorem ipsum,True,0,0,uname6,2,2,False,True
6,7,Лжедмитрий,II,1,4,биография 6 lorem ipsum lorem ipsum lorem ipsum,True,0,0,uname6,2,1,False,True
7,421423205,Астахов,Сергей,1,2,биография А.С. lorem ipsum lorem ipsum lorem i...,True,0,0,trickster2038,2,1,False,False

In [79]:
select("beta_friendst")

   id      user1      user2  applied
0   0  421423205          1    False
1   1  421423205          2    False
2   2          3  421423205    False
3   3          4  421423205    False

In [80]:
select("auth_user")

,id,password,last_login,is_superuser,username,first_name,last_name,email,is_staff,is_active,date_joined
0,11,pass1,2021-07-06 12:54:46+00:00,False,user1,,,,False,True,2021-05-06 12:54:46+00:00
1,1,pbkdf2_sha256$260000$X8pFctbi2dDuYHPw7cZy3x$Q0...,2021-09-30 13:14:24.912440+00:00,True,admin,,,fzastahov@gmail.com,True,True,2021-09-05 21:38:51.020657+00:00
2,14,pbkdf2_sha256$260000$H85EJhbgZ11K35tK2QmBov$R8...,2021-09-30 13:15:33.047749+00:00,False,421423205,,,,False,True,2021-09-25 17:04:04.740698+00:00

In [81]:
# select("beta_image2")

In [82]:
select("beta_UserImage")

Empty DataFrame
Columns: [id, user, image, folder]
Index: []

In [83]:
select("beta_UserImage")

Empty DataFrame
Columns: [id, user, image, folder]
Index: []